validation/0.orig/air/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform INITIALTEMPERATURE;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    
    airLeft
    {
        type            fixedValue;
        value           uniform INITIALTEMPERATURE;
    }
   
    airTop
    {
        type            zeroGradient;
    }
   
    airBottom
    {
        type            zeroGradient;
    }
    
    air_to_pcm    
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        value           $internalField;
        Tnbr            T;
        kappa           kappa;
        kappaMethod     fluidThermo;
    }
    
    frontAndBack
    { 
        type            empty;
    }
}

// ************************************************************************* //
