validation/0.orig/pcm/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform INITIALTEMPERATURE;

boundaryField
{
       #includeEtc "caseDicts/setConstraintTypes"
    
    pcmRight
    {
        type            codedMixed;

        refValue        uniform INITIALTEMPERATURE;
        refGradient     uniform 0;
        valueFraction   uniform 0;

        name    heatFlux;   // name of generated BC

        code
        #{
            const volScalarField& kappa=this->db().lookupObject<volScalarField>("kappa");
            dimensionedScalar q("heatFlux",dimEnergy/dimArea,HEATFLUX);
            Info<<"q="<<q<<endl;
            Info<<"kappa="<<kappa.boundaryField()[this->patch().index()]<<endl;
            
            this->refValue() =0;
            this->refGrad() = q.value()/(kappa.boundaryField()[this->patch().index()]);
            this->valueFraction() = 0.0;
        #};

    }
   
    pcmTop
    {
        type            zeroGradient;
    }
   
    pcmBottom
    {
        type            zeroGradient;
    }
    
    pcm_to_air
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        value           $internalField;
        Tnbr            T;
        kappaMethod     lookup;
        kappa           kappa;
    }
    
    frontAndBack
    { 
        type            empty;
    }
}

// ************************************************************************* //
