validation/0.orig/pcm/alpha.solid
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 0 0 0 0 ];

internalField   uniform 1;

boundaryField
{
       #includeEtc "caseDicts/setConstraintTypes"
    
    pcmRight
    {
        type            zeroGradient;
    }
   
    pcmTop
    {
        type            zeroGradient;
    }
   
    pcmBottom
    {
        type            zeroGradient;
    }
    
    pcm_to_air
    {
        type            zeroGradient;
    }
    
    frontAndBack
    { 
        type            empty;
    }
}

// ************************************************************************* //
