validation/constant/air/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/air/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    airLeft
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          120;
        startFace       19000;
    }
    airBottom
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          80;
        startFace       19120;
    }
    airTop
    {
        type            patch;
        nFaces          80;
        startFace       19200;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          19200;
        startFace       19280;
    }
    air_to_pcm
    {
        type            mappedWall;
        inGroups        List<word> 1(wall);
        nFaces          120;
        startFace       38480;
        sampleMode      nearestPatchFace;
        sampleRegion    pcm;
        samplePatch     pcm_to_air;
    }
)

// ************************************************************************* //
