validation/constant/pcm/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/pcm/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    pcmRight
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          120;
        startFace       11830;
    }
    pcmTop
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          50;
        startFace       11950;
    }
    pcmBottom
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          50;
        startFace       12000;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          12000;
        startFace       12050;
    }
    pcm_to_air
    {
        type            mappedWall;
        inGroups        List<word> 1(wall);
        nFaces          120;
        startFace       24050;
        sampleMode      nearestPatchFace;
        sampleRegion    air;
        samplePatch     air_to_pcm;
    }
)

// ************************************************************************* //
