validation/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    airLeft
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          120;
        startFace       30950;
    }
    airBottom
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          80;
        startFace       31070;
    }
    airTop
    {
        type            patch;
        nFaces          80;
        startFace       31150;
    }
    pcmRight
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          120;
        startFace       31230;
    }
    pcmTop
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          50;
        startFace       31350;
    }
    pcmBottom
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          50;
        startFace       31400;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          31200;
        startFace       31450;
    }
)

// ************************************************************************* //
